## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for sandboxy environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (19 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "TF_VAR_VAULT_TOKEN"
                                property = "data.TF_VAR_VAULT_TOKEN"
                            }
                            secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_kubeconfig_path"
                              + property = "data.TF_VAR_kubeconfig_path"
                            }
                          + secretKey = "TF_VAR_kubeconfig_path"
                        },
                        {
                            remoteRef = {
                                key      = "TF_VAR_pm_api_token_id"
                                property = "data.TF_VAR_pm_api_token_id"
                            }
                            secretKey = "TF_VAR_pm_api_token_id"
                        },
                        # (3 unchanged elements hidden)
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (19 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "TF_VAR_VAULT_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.TF_VAR_VAULT_TOKEN"
                                version            = null
                            }
                            secretKey = "TF_VAR_VAULT_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "TF_VAR_kubeconfig_path"
                              + metadataPolicy     = "None"
                              + property           = "data.TF_VAR_kubeconfig_path"
                              + version            = null
                            }
                          + secretKey = "TF_VAR_kubeconfig_path"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "TF_VAR_pm_api_token_id"
                                metadataPolicy     = "None"
                                property           = "data.TF_VAR_pm_api_token_id"
                                version            = null
                            }
                            secretKey = "TF_VAR_pm_api_token_id"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                        # (1 unchanged element hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "VAULT_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.VAULT_TOKEN"
                                version            = null
                            }
                            secretKey = "VAULT_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ conversionStrategy = "Default" -> (known after apply)
                              ~ decodingStrategy   = "None" -> (known after apply)
                              ~ metadataPolicy     = "None" -> (known after apply)
                              + version            = (known after apply)
                                # (2 unchanged attributes hidden)
                            }
                          ~ sourceRef = {
                              ~ generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              ~ storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                            # (1 unchanged attribute hidden)
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"] will be updated in-place
  ~ resource "kubectl_manifest" "cdi_operator" {
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"
        name                    = "cdis.cdi.kubevirt.io"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for cluster-api environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.externaldns[0].kubernetes_cluster_role.externaldns will be created
  + resource "kubernetes_cluster_role" "externaldns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "services",
              + "endpoints",
              + "pods",
            ]
          + verbs      = [
              + "get",
              + "watch",
              + "list",
            ]
        }
      + rule {
          + api_groups = [
              + "extensions",
              + "networking.k8s.io",
            ]
          + resources  = [
              + "ingresses",
            ]
          + verbs      = [
              + "get",
              + "watch",
              + "list",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "nodes",
            ]
          + verbs      = [
              + "list",
              + "watch",
            ]
        }
    }

  # module.externaldns[0].kubernetes_cluster_role_binding.externaldns will be created
  + resource "kubernetes_cluster_role_binding" "externaldns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns-viewer"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "external-dns"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "external-dns"
          + namespace = "external-dns"
        }
    }

  # module.externaldns[0].kubernetes_deployment.externaldns will be created
  + resource "kubernetes_deployment" "externaldns" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns"
          + namespace        = "external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "external-dns"
                }
            }

          + strategy (known after apply)

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "external-dns"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = false
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = "external-dns"
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + args                       = [
                          + "--pihole-tls-skip-verify",
                          + "--source=ingress",
                          + "--registry=noop",
                          + "--policy=upsert-only",
                          + "--provider=pihole",
                          + "--pihole-server=http://192.168.1.3",
                        ]
                      + image                      = "registry.k8s.io/external-dns/external-dns:v0.14.1"
                      + image_pull_policy          = (known after apply)
                      + name                       = "external-dns"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name = "EXTERNAL_DNS_PIHOLE_PASSWORD"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "PIHOLE_PASSWORD"
                                  + name = "cluster-secrets"
                                }
                            }
                        }

                      + env_from {
                          + secret_ref {
                              + name     = "cluster-secrets"
                              + optional = true
                            }
                        }

                      + resources (known after apply)
                    }

                  + image_pull_secrets (known after apply)

                  + readiness_gate (known after apply)

                  + security_context {
                      + fs_group        = "65534"
                      + run_as_non_root = false
                    }
                }
            }
        }
    }

  # module.externaldns[0].kubernetes_service_account.externaldns will be created
  + resource "kubernetes_service_account" "externaldns" {
      + automount_service_account_token = false
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns"
          + namespace        = "external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cert_manager[0].module.cloudflare_secret.kubernetes_secret.this[0] will be created
  + resource "kubernetes_secret" "this" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "cloudflare-api-token"
          + namespace        = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cert_manager[0].module.helm.helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                installCRDs: true
            EOT,
        ]
      + verify                     = false
      + version                    = "v1.16.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
    }

  # module.cert_manager[0].module.namespace.kubernetes_namespace.this[0] will be created
  + resource "kubernetes_namespace" "this" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "kubernetes.io/metadata.name" = "cert-manager"
            }
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.external_secrets[0].module.helm.helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = true
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets"
      + namespace                  = "external-secrets"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 120
      + values                     = [
          + <<-EOT
                installCRDs: true
            EOT,
        ]
      + verify                     = false
      + version                    = "0.12.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.external_secrets[0].module.namespace.kubernetes_namespace.this[0] will be created
  + resource "kubernetes_namespace" "this" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "kubernetes.io/metadata.name" = "external-secrets"
            }
          + name             = "external-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.external_secrets[0].module.vault_token_secret.kubernetes_secret.this[0] will be created
  + resource "kubernetes_secret" "this" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "vault-token"
          + namespace        = "external-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.externaldns[0].module.namespace.kubernetes_namespace.this[0] will be created
  + resource "kubernetes_namespace" "this" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "cluster-secrets"             = "true"
              + "kubernetes.io/metadata.name" = "external-dns"
            }
          + name             = "external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  